---
kind: method
id: M:Autodesk.Revit.DB.STLExportOptions.IsNormalToleranceSet
source: html/cbdb380b-6ee8-8110-7bb8-5137538bdd10.htm
---
# Autodesk.Revit.DB.STLExportOptions.IsNormalToleranceSet Method

Checks whether the NormalTolerance tessellation parameter is explicitly set.

## Syntax (C#)
```csharp
public bool IsNormalToleranceSet()
```

## Returns
True if NormalTolerance tessellation parameter is explicitly set, false otherwise.